## Plan Result (sbox_apim_migration)




<pre><code>Plan: 25 to add, 0 to change, 0 to destroy.</code></pre>

* Create
  * azurerm_api_management_named_value.environment
  * azurerm_public_ip.temp_pip
  * module.api-mgmt.azurerm_api_management.apim
  * module.api-mgmt.azurerm_api_management_api.apim
  * module.api-mgmt.azurerm_api_management_api_operation.apim
  * module.api-mgmt.azurerm_api_management_api_policy.apim
  * module.api-mgmt.azurerm_api_management_custom_domain.api-management-custom-domain
  * module.api-mgmt.azurerm_api_management_logger.apim
  * module.api-mgmt.azurerm_network_security_group.apim
  * module.api-mgmt.azurerm_network_security_rule.AccessRedisService
  * module.api-mgmt.azurerm_network_security_rule.SyncCounter
  * module.api-mgmt.azurerm_network_security_rule.apimanagement
  * module.api-mgmt.azurerm_network_security_rule.deny
  * module.api-mgmt.azurerm_network_security_rule.loadbalancer
  * module.api-mgmt.azurerm_network_security_rule.palo
  * module.api-mgmt.azurerm_network_security_rule.vpn
  * module.api-mgmt.azurerm_public_ip.apim
  * module.api-mgmt.azurerm_role_assignment.apim
  * module.api-mgmt.azurerm_route.azure_control_plane
  * module.api-mgmt.azurerm_route.default_route
  * module.api-mgmt.azurerm_route_table.route_table
  * module.api-mgmt.azurerm_subnet_network_security_group_association.apim
  * module.api-mgmt.azurerm_subnet_route_table_association.api-mgmt-subnet
  * module.api-mgmt.module.application_insights.azurerm_application_insights.this
  * module.api-mgmt.module.application_insights.azurerm_monitor_activity_log_alert.main




<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_api_management_named_value.environment will be created
  + resource "azurerm_api_management_named_value" "environment" {
      + api_management_name = "cft-api-mgmt-sbox"
      + display_name        = "environment"
      + id                  = (known after apply)
      + name                = "environment"
      + resource_group_name = "cft-sbox-network-rg"
      + secret              = false
      + value               = (sensitive value)
    }

  # azurerm_public_ip.temp_pip will be created
  + resource "azurerm_public_ip" "temp_pip" {
      + allocation_method       = "Static"
      + ddos_protection_mode    = "VirtualNetworkInherited"
      + domain_name_label       = "temp-pip"
      + fqdn                    = (known after apply)
      + id                      = (known after apply)
      + idle_timeout_in_minutes = 4
      + ip_address              = (known after apply)
      + ip_version              = "IPv4"
      + location                = "uksouth"
      + name                    = "temp-pip"
      + resource_group_name     = "cft-sbox-network-rg"
      + sku                     = "Standard"
      + sku_tier                = "Regional"
      + tags                    = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/azure-platform-terraform"
          + "businessArea" = "CFT"
          + "criticality"  = "Low"
          + "environment"  = "sandbox"
          + "expiresAfter" = "3000-01-01"
          + "startupMode"  = "always"
        }
    }

  # module.api-mgmt.data.azurerm_api_management.apim will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_api_management" "apim" {
      + additional_location       = (known after apply)
      + developer_portal_url      = (known after apply)
      + gateway_regional_url      = (known after apply)
      + gateway_url               = (known after apply)
      + hostname_configuration    = (known after apply)
      + id                        = (known after apply)
      + identity                  = (known after apply)
      + location                  = (known after apply)
      + management_api_url        = (known after apply)
      + name                      = "cft-api-mgmt-sbox"
      + notification_sender_email = (known after apply)
      + portal_url                = (known after apply)
      + private_ip_addresses      = (known after apply)
      + public_ip_address_id      = (known after apply)
      + public_ip_addresses       = (known after apply)
      + publisher_email           = (known after apply)
      + publisher_name            = (known after apply)
      + resource_group_name       = "cft-sbox-network-rg"
      + scm_url                   = (known after apply)
      + sku_name                  = (known after apply)
      + tenant_access             = (known after apply)
    }

  # module.api-mgmt.azurerm_api_management.apim will be created
  + resource "azurerm_api_management" "apim" {
      + client_certificate_enabled    = false
      + developer_portal_url          = (known after apply)
      + gateway_disabled              = false
      + gateway_regional_url          = (known after apply)
      + gateway_url                   = (known after apply)
      + id                            = (known after apply)
      + location                      = "uksouth"
      + management_api_url            = (known after apply)
      + name                          = "cft-api-mgmt-sbox"
      + notification_sender_email     = "apimgmt-noreply@mail.windowsazure.com"
      + policy                        = (known after apply)
      + portal_url                    = (known after apply)
      + private_ip_addresses          = (known after apply)
      + public_ip_address_id          = (known after apply)
      + public_ip_addresses           = (known after apply)
      + public_network_access_enabled = true
      + publisher_email               = "DTSPlatformOperations@justice.gov.uk"
      + publisher_name                = "HMCTS Platform Operations"
      + resource_group_name           = "cft-sbox-network-rg"
      + scm_url                       = (known after apply)
      + sku_name                      = "Developer_1"
      + tags                          = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/azure-platform-terraform"
          + "businessArea" = "CFT"
          + "criticality"  = "Low"
          + "environment"  = "sandbox"
          + "expiresAfter" = "3000-01-01"
          + "startupMode"  = "always"
        }
      + virtual_network_type          = "Internal"

      + identity {
          + principal_id = (known after apply)
          + tenant_id    = (known after apply)
          + type         = "SystemAssigned"
        }

      + security {
          + enable_backend_ssl30                                = false
          + enable_backend_tls10                                = false
          + enable_backend_tls11                                = false
          + enable_frontend_ssl30                               = false
          + enable_frontend_tls10                               = false
          + enable_frontend_tls11                               = false
          + tls_ecdhe_ecdsa_with_aes128_cbc_sha_ciphers_enabled = false
          + tls_ecdhe_ecdsa_with_aes256_cbc_sha_ciphers_enabled = false
          + tls_ecdhe_rsa_with_aes128_cbc_sha_ciphers_enabled   = false
          + tls_ecdhe_rsa_with_aes256_cbc_sha_ciphers_enabled   = false
          + tls_rsa_with_aes128_cbc_sha256_ciphers_enabled      = false
          + tls_rsa_with_aes128_cbc_sha_ciphers_enabled         = false
          + tls_rsa_with_aes128_gcm_sha256_ciphers_enabled      = false
          + tls_rsa_with_aes256_cbc_sha256_ciphers_enabled      = false
          + tls_rsa_with_aes256_cbc_sha_ciphers_enabled         = false
          + tls_rsa_with_aes256_gcm_sha384_ciphers_enabled      = false
          + triple_des_ciphers_enabled                          = false
        }

      + virtual_network_configuration {
          + subnet_id = "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb/resourceGroups/cft-sbox-network-rg/providers/Microsoft.Network/virtualNetworks/cft-sbox-vnet/subnets/iaas"
        }
    }

  # module.api-mgmt.azurerm_api_management_api.apim will be created
  + resource "azurerm_api_management_api" "apim" {
      + api_management_name   = "cft-api-mgmt-sbox"
      + api_type              = (known after apply)
      + display_name          = "Health Check"
      + id                    = (known after apply)
      + is_current            = (known after apply)
      + is_online             = (known after apply)
      + name                  = "health"
      + path                  = "health"
      + protocols             = [
          + "http",
          + "https",
        ]
      + resource_group_name   = "cft-sbox-network-rg"
      + revision              = "1"
      + service_url           = (known after apply)
      + soap_pass_through     = (known after apply)
      + subscription_required = false
      + version               = (known after apply)
      + version_set_id        = (known after apply)
    }

  # module.api-mgmt.azurerm_api_management_api_operation.apim will be created
  + resource "azurerm_api_management_api_operation" "apim" {
      + api_management_name = "cft-api-mgmt-sbox"
      + api_name            = "health"
      + description         = "This can only be done by the logged in user."
      + display_name        = "Liveness check"
      + id                  = (known after apply)
      + method              = "GET"
      + operation_id        = "liveness-check"
      + resource_group_name = "cft-sbox-network-rg"
      + url_template        = "/liveness"

      + response {
          + status_code = 200

          + representation {
              + content_type = "application/json"

              + example {
                  + name  = "sample value"
                  + value = jsonencode(
                        {
                          + status = "Up"
                        }
                    )
                }
            }
        }
    }

  # module.api-mgmt.azurerm_api_management_api_policy.apim will be created
  + resource "azurerm_api_management_api_policy" "apim" {
      + api_management_name = "cft-api-mgmt-sbox"
      + api_name            = "health"
      + id                  = (known after apply)
      + resource_group_name = "cft-sbox-network-rg"
      + xml_content         = <<-EOT
            <policies>
                <inbound>
                    <mock-response status-code="200" content-type="application/json" />
                </inbound>
                <backend>
                    <base />
                </backend>
                <outbound>
                    <base />
                </outbound>
                <on-error>
                    <base />
                </on-error>
            </policies>
        EOT
    }

  # module.api-mgmt.azurerm_api_management_custom_domain.api-management-custom-domain will be created
  + resource "azurerm_api_management_custom_domain" "api-management-custom-domain" {
      + api_management_id = (known after apply)
      + id                = (known after apply)

      + gateway {
          + certificate_source           = (known after apply)
          + certificate_status           = (known after apply)
          + default_ssl_binding          = true
          + expiry                       = (known after apply)
          + host_name                    = "cft-api-mgmt.sandbox.platform.hmcts.net"
          + key_vault_id                 = "https://acmedcdcftappssbox.vault.azure.net/secrets/wildcard-sandbox-platform-hmcts-net"
          + negotiate_client_certificate = true
          + subject                      = (known after apply)
          + thumbprint                   = (known after apply)
        }
      + gateway {
          + certificate_source           = (known after apply)
          + certificate_status           = (known after apply)
          + default_ssl_binding          = true
          + expiry                       = (known after apply)
          + host_name                    = "cft-api-mgmt-appgw.sandbox.platform.hmcts.net"
          + key_vault_id                 = "https://acmedcdcftappssbox.vault.azure.net/secrets/wildcard-sandbox-platform-hmcts-net"
          + negotiate_client_certificate = true
          + subject                      = (known after apply)
          + thumbprint                   = (known after apply)
        }
      + gateway {
          + certificate_source           = (known after apply)
          + certificate_status           = (known after apply)
          + default_ssl_binding          = true
          + expiry                       = (known after apply)
          + host_name                    = "cft-mtls-api-mgmt-appgw.sandbox.platform.hmcts.net"
          + key_vault_id                 = "https://acmedcdcftappssbox.vault.azure.net/secrets/wildcard-sandbox-platform-hmcts-net"
          + negotiate_client_certificate = true
          + subject                      = (known after apply)
          + thumbprint                   = (known after apply)
        }
    }

  # module.api-mgmt.azurerm_api_management_logger.apim will be created
  + resource "azurerm_api_management_logger" "apim" {
      + api_management_name = "cft-api-mgmt-sbox"
      + buffered            = true
      + id                  = (known after apply)
      + name                = "cft-api-mgmt-sbox-logger"
      + resource_group_name = "cft-sbox-network-rg"
      + resource_id         = (known after apply)

      + application_insights {
          + instrumentation_key = (sensitive value)
        }
    }

  # module.api-mgmt.azurerm_network_security_group.apim will be created
  + resource "azurerm_network_security_group" "apim" {
      + id                  = (known after apply)
      + location            = "uksouth"
      + name                = "cft-api-mgmt-sbox-nsg"
      + resource_group_name = "cft-sbox-network-rg"
      + security_rule       = (known after apply)
      + tags                = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/azure-platform-terraform"
          + "businessArea" = "CFT"
          + "criticality"  = "Low"
          + "environment"  = "sandbox"
          + "expiresAfter" = "3000-01-01"
          + "startupMode"  = "always"
        }
    }

  # module.api-mgmt.azurerm_network_security_rule.AccessRedisService will be created
  + resource "azurerm_network_security_rule" "AccessRedisService" {
      + access                      = "Allow"
      + destination_address_prefix  = "VirtualNetwork"
      + destination_port_ranges     = [
          + "6381",
          + "6382",
          + "6383",
        ]
      + direction                   = "Inbound"
      + id                          = (known after apply)
      + name                        = "AccessRedisService"
      + network_security_group_name = "cft-api-mgmt-sbox-nsg"
      + priority                    = 103
      + protocol                    = "Tcp"
      + resource_group_name         = "cft-sbox-network-rg"
      + source_address_prefix       = "VirtualNetwork"
      + source_port_range           = "*"
    }

  # module.api-mgmt.azurerm_network_security_rule.SyncCounter will be created
  + resource "azurerm_network_security_rule" "SyncCounter" {
      + access                      = "Allow"
      + destination_address_prefix  = "VirtualNetwork"
      + destination_port_ranges     = [
          + "4290",
        ]
      + direction                   = "Inbound"
      + id                          = (known after apply)
      + name                        = "SyncCounter"
      + network_security_group_name = "cft-api-mgmt-sbox-nsg"
      + priority                    = 104
      + protocol                    = "Udp"
      + resource_group_name         = "cft-sbox-network-rg"
      + source_address_prefix       = "VirtualNetwork"
      + source_port_range           = "*"
    }

  # module.api-mgmt.azurerm_network_security_rule.apimanagement will be created
  + resource "azurerm_network_security_rule" "apimanagement" {
      + access                      = "Allow"
      + destination_address_prefix  = "VirtualNetwork"
      + destination_port_range      = "3443"
      + direction                   = "Inbound"
      + id                          = (known after apply)
      + name                        = "apimanagement"
      + network_security_group_name = "cft-api-mgmt-sbox-nsg"
      + priority                    = 101
      + protocol                    = "Tcp"
      + resource_group_name         = "cft-sbox-network-rg"
      + source_address_prefix       = "ApiManagement"
      + source_port_range           = "*"
    }

  # module.api-mgmt.azurerm_network_security_rule.deny will be created
  + resource "azurerm_network_security_rule" "deny" {
      + access                      = "Deny"
      + destination_address_prefix  = "*"
      + destination_port_range      = "*"
      + direction                   = "Inbound"
      + id                          = (known after apply)
      + name                        = "deny"
      + network_security_group_name = "cft-api-mgmt-sbox-nsg"
      + priority                    = 500
      + protocol                    = "*"
      + resource_group_name         = "cft-sbox-network-rg"
      + source_address_prefix       = "*"
      + source_port_range           = "*"
    }

  # module.api-mgmt.azurerm_network_security_rule.loadbalancer will be created
  + resource "azurerm_network_security_rule" "loadbalancer" {
      + access                      = "Allow"
      + destination_address_prefix  = "VirtualNetwork"
      + destination_port_range      = "*"
      + direction                   = "Inbound"
      + id                          = (known after apply)
      + name                        = "loadbalancer"
      + network_security_group_name = "cft-api-mgmt-sbox-nsg"
      + priority                    = 105
      + protocol                    = "Tcp"
      + resource_group_name         = "cft-sbox-network-rg"
      + source_address_prefix       = "VirtualNetwork"
      + source_port_range           = "*"
    }

  # module.api-mgmt.azurerm_network_security_rule.palo will be created
  + resource "azurerm_network_security_rule" "palo" {
      + access                      = "Allow"
      + destination_address_prefix  = "VirtualNetwork"
      + destination_port_range      = "80"
      + direction                   = "Inbound"
      + id                          = (known after apply)
      + name                        = "palo"
      + network_security_group_name = "cft-api-mgmt-sbox-nsg"
      + priority                    = 100
      + protocol                    = "Tcp"
      + resource_group_name         = "cft-sbox-network-rg"
      + source_address_prefixes     = [
          + "10.10.200.37",
          + "10.10.200.38",
        ]
      + source_port_range           = "*"
    }

  # module.api-mgmt.azurerm_network_security_rule.vpn will be created
  + resource "azurerm_network_security_rule" "vpn" {
      + access                      = "Allow"
      + destination_address_prefix  = "VirtualNetwork"
      + destination_port_ranges     = [
          + "443",
          + "80",
        ]
      + direction                   = "Inbound"
      + id                          = (known after apply)
      + name                        = "vpn"
      + network_security_group_name = "cft-api-mgmt-sbox-nsg"
      + priority                    = 102
      + protocol                    = "Tcp"
      + resource_group_name         = "cft-sbox-network-rg"
      + source_address_prefix       = "10.99.0.0/18"
      + source_port_range           = "*"
    }

  # module.api-mgmt.azurerm_public_ip.apim will be created
  + resource "azurerm_public_ip" "apim" {
      + allocation_method       = "Static"
      + ddos_protection_mode    = "VirtualNetworkInherited"
      + domain_name_label       = "cft-api-mgmt-sbox-pip"
      + fqdn                    = (known after apply)
      + id                      = (known after apply)
      + idle_timeout_in_minutes = 4
      + ip_address              = (known after apply)
      + ip_version              = "IPv4"
      + location                = "uksouth"
      + name                    = "cft-api-mgmt-sbox-private-pip"
      + resource_group_name     = "cft-sbox-network-rg"
      + sku                     = "Standard"
      + sku_tier                = "Regional"
      + tags                    = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/azure-platform-terraform"
          + "businessArea" = "CFT"
          + "criticality"  = "Low"
          + "environment"  = "sandbox"
          + "expiresAfter" = "3000-01-01"
          + "startupMode"  = "always"
        }
    }

  # module.api-mgmt.azurerm_role_assignment.apim will be created
  + resource "azurerm_role_assignment" "apim" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Key Vault Secrets User"
      + scope                            = "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb/resourceGroups/cft-platform-sbox-rg/providers/Microsoft.KeyVault/vaults/acmedcdcftappssbox"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.api-mgmt.azurerm_route.azure_control_plane will be created
  + resource "azurerm_route" "azure_control_plane" {
      + address_prefix      = "51.145.56.125/32"
      + id                  = (known after apply)
      + name                = "azure-control-plane"
      + next_hop_type       = "Internet"
      + resource_group_name = "cft-sbox-network-rg"
      + route_table_name    = "cft-api-mgmt-sbox-route-table"
    }

  # module.api-mgmt.azurerm_route.default_route will be created
  + resource "azurerm_route" "default_route" {
      + address_prefix         = "0.0.0.0/0"
      + id                     = (known after apply)
      + name                   = "default"
      + next_hop_in_ip_address = "10.10.200.36"
      + next_hop_type          = "VirtualAppliance"
      + resource_group_name    = "cft-sbox-network-rg"
      + route_table_name       = "cft-api-mgmt-sbox-route-table"
    }

  # module.api-mgmt.azurerm_route_table.route_table will be created
  + resource "azurerm_route_table" "route_table" {
      + disable_bgp_route_propagation = false
      + id                            = (known after apply)
      + location                      = "uksouth"
      + name                          = "cft-api-mgmt-sbox-route-table"
      + resource_group_name           = "cft-sbox-network-rg"
      + route                         = (known after apply)
      + subnets                       = (known after apply)
      + tags                          = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/azure-platform-terraform"
          + "businessArea" = "CFT"
          + "criticality"  = "Low"
          + "environment"  = "sandbox"
          + "expiresAfter" = "3000-01-01"
          + "startupMode"  = "always"
        }
    }

  # module.api-mgmt.azurerm_subnet_network_security_group_association.apim will be created
  + resource "azurerm_subnet_network_security_group_association" "apim" {
      + id                        = (known after apply)
      + network_security_group_id = (known after apply)
      + subnet_id                 = "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb/resourceGroups/cft-sbox-network-rg/providers/Microsoft.Network/virtualNetworks/cft-sbox-vnet/subnets/api-management"
    }

  # module.api-mgmt.azurerm_subnet_route_table_association.api-mgmt-subnet will be created
  + resource "azurerm_subnet_route_table_association" "api-mgmt-subnet" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb/resourceGroups/cft-sbox-network-rg/providers/Microsoft.Network/virtualNetworks/cft-sbox-vnet/subnets/api-management"
    }

  # module.api-mgmt.module.application_insights.azurerm_application_insights.this will be created
  + resource "azurerm_application_insights" "this" {
      + app_id                                = (known after apply)
      + application_type                      = "other"
      + connection_string                     = (sensitive value)
      + daily_data_cap_in_gb                  = 50
      + daily_data_cap_notifications_disabled = true
      + disable_ip_masking                    = false
      + force_customer_storage_for_profiler   = false
      + id                                    = (known after apply)
      + instrumentation_key                   = (sensitive value)
      + internet_ingestion_enabled            = true
      + internet_query_enabled                = true
      + local_authentication_disabled         = false
      + location                              = "uksouth"
      + name                                  = "cft-api-mgmt-sbox"
      + resource_group_name                   = "cft-sbox-network-rg"
      + retention_in_days                     = 90
      + sampling_percentage                   = 100
      + tags                                  = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/azure-platform-terraform"
          + "businessArea" = "CFT"
          + "criticality"  = "Low"
          + "environment"  = "sandbox"
          + "expiresAfter" = "3000-01-01"
          + "startupMode"  = "always"
        }
      + workspace_id                          = "/subscriptions/bf308a5c-0624-4334-8ff8-8dca9fd43783/resourceGroups/oms-automation/providers/Microsoft.OperationalInsights/workspaces/hmcts-sandbox"
    }

  # module.api-mgmt.module.application_insights.azurerm_monitor_activity_log_alert.main will be created
  + resource "azurerm_monitor_activity_log_alert" "main" {
      + description         = "Monitors for application insight reaching it's daily cap."
      + enabled             = true
      + id                  = (known after apply)
      + location            = "global"
      + name                = "Application Insights daily cap reached - cft-api-mgmt-sbox"
      + resource_group_name = "cft-sbox-network-rg"
      + scopes              = (known after apply)
      + tags                = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/azure-platform-terraform"
          + "businessArea" = "CFT"
          + "criticality"  = "Low"
          + "environment"  = "sandbox"
          + "expiresAfter" = "3000-01-01"
          + "startupMode"  = "always"
        }

      + action {
          + action_group_id    = "/subscriptions/1baf5470-1c3e-40d3-a6f7-74bfbce4b348/resourceGroups/cft-alerts-slack-ptl/providers/Microsoft.Insights/actionGroups/cft-alerts-slack-warning-alerts"
          + webhook_properties = {
              + "from"           = "terraform"
              + "slackChannelId" = null
            }
        }

      + criteria {
          + category       = "Administrative"
          + level          = "Warning"
          + operation_name = "Microsoft.Insights/Components/DailyCapReached/Action"
          + resource_id    = (known after apply)
        }
    }

Plan: 25 to add, 0 to change, 0 to destroy.
```

</details>





<!-- github-comment: {"Command":"plan","PRNumber":2097,"Program":"tfcmt","SHA1":"","Target":"sbox_apim_migration","Vars":{}} -->